// Доп
// Задача 35:Задайте одномерный массив из 123 случайных чисел [0: 1000].
// Найдите количество элементов массива, значения которых лежат в отрезке [10,99].

// Пример для массива из 5, а не 123 элементов. В своём решении сделайте для 123

// [5, 18, 123, 6, 2] -> 1

// [1, 2, 3, 6, 2]-> 0

// [10, 11, 12, 13, 14]-> 5

int[] array = new int[123];
Random random = new Random();
int count = 0;

// заполнение массива случайными числами
for (int i = 0; i < array.Length; i++)
{
    array[i] = random.Next(1001);
}

// поиск элементов, значения которых лежат в отрезке [10, 99]
foreach (int num in array)
{
    if (num >= 10 && num <= 99)
    {
        count++;
    }
}

Console.WriteLine(count);